[
  {
    "frage": "1. Was ist ein wesentlicher Unterschied im Anmeldeverfahren dieser App im Vergleich zu Anki oder Quizlet?",
    "optionen": [
      "Diese App erfordert eine Zwei-Faktor-Authentifizierung.",
      "Diese App nutzt ein anonymes Pseudonym-System ohne Registrierung.",
      "Man muss sich mit einem Social-Media-Konto anmelden.",
      "Der Zugang ist nur über eine kostenpflichtige Lizenz möglich."
    ],
    "loesung": 1,
    "erklaerung": "Im Gegensatz zu Anki oder Quizlet, die oft eine Kontoerstellung für die Synchronisation erfordern, setzt diese App auf anonyme Pseudonyme pro Testrunde. Das erleichtert den Einstieg und schützt die Privatsphäre.",
    "gewichtung": 1,
    "thema": "Grundkonzept & Login"
  },
  {
    "frage": "2. Wie werden die Fortschrittsdaten in dieser App standardmäßig gespeichert, im Gegensatz zu Cloud-basierten Apps wie Quizlet?",
    "optionen": [
      "In einer zentralen, verschlüsselten Cloud-Datenbank.",
      "Lokal in einer einzigen CSV-Datei (`mc_test_answers.csv`).",
      "Direkt im Browser-Cache, der beim Schließen gelöscht wird.",
      "Auf einem externen FTP-Server."
    ],
    "loesung": 1,
    "erklaerung": "Die App ist für den einfachen Einsatz konzipiert und speichert alle Antworten in einer lokalen CSV-Datei. Dies unterscheidet sich von Apps wie Quizlet, die Daten in der Cloud speichern, um sie über Geräte hinweg zu synchronisieren.",
    "gewichtung": 2,
    "thema": "Daten & Infrastruktur"
  },
  {
    "frage": "3. Welches einzigartige Feature bietet das Admin-Panel dieser App, das in Standard-Lernapps wie Anki nicht enthalten ist?",
    "optionen": [
      "Die Möglichkeit, die Schriftgröße zu ändern.",
      "Eine detaillierte psychometrische Item-Analyse (Schwierigkeit, Trennschärfe).",
      "Das Erstellen von Karteikarten mit Bildern.",
      "Ein integrierter Kalender zur Planung von Lernsitzungen."
    ],
    "loesung": 1,
    "erklaerung": "Das Admin-Panel bietet eine tiefgehende Analyse der Fragenqualität, einschließlich Schwierigkeit und Trennschärfe. Dies ist ein Feature, das typischerweise in professionellen Test-Autorentools zu finden ist, aber nicht in gängigen Lern-Apps.",
    "gewichtung": 3,
    "thema": "Admin-Features"
  },
  {
    "frage": "4. Wie werden neue Fragensets in dieser App hinzugefügt?",
    "optionen": [
      "Durch den Kauf von Erweiterungspaketen im App-Store.",
      "Durch das einfache Hinzufügen einer neuen `questions_*.json`-Datei in das Projektverzeichnis.",
      "Durch eine komplexe Datenbankmigration, die von einem Administrator durchgeführt werden muss.",
      "Neue Inhalte können nur vom ursprünglichen Entwickler hinzugefügt werden."
    ],
    "loesung": 1,
    "erklaerung": "Die App ist so konzipiert, dass sie extrem einfach erweiterbar ist. Jede korrekt formatierte JSON-Datei, die dem Namensschema `questions_*.json` folgt, wird automatisch als neues Fragenset erkannt und im Menü angeboten.",
    "gewichtung": 1,
    "thema": "Anpassbarkeit"
  },
  {
    "frage": "5. Was ist der Hauptfokus dieser App im Vergleich zu Anki, das für 'Spaced Repetition' bekannt ist?",
    "optionen": [
      "Das langfristige Auswendiglernen von Vokabeln.",
      "Die Simulation von Prüfungssituationen mit Multiple-Choice-Fragen und Zeitlimit.",
      "Das Erstellen von Mind-Maps und visuellen Lernkarten.",
      "Die kollaborative Bearbeitung von Dokumenten in Echtzeit."
    ],
    "loesung": 1,
    "erklaerung": "Während Anki auf das effiziente Wiederholen von Fakten über lange Zeiträume spezialisiert ist, liegt der Fokus dieser App auf der Durchführung und Analyse von Multiple-Choice-Tests, die eine typische Prüfungssituation nachbilden.",
    "gewichtung": 2,
    "thema": "Grundkonzept & Login"
  },
  {
    "frage": "6. Welches Feature zur Leistungsanalyse wird dem Nutzer am Ende eines Tests angezeigt, das über eine reine Punktzahl hinausgeht?",
    "optionen": [
      "Ein Vergleich mit dem weltweiten Durchschnitt aller Nutzer.",
      "Eine Liste von Literaturempfehlungen basierend auf falschen Antworten.",
      "Ein Balkendiagramm, das die prozentuale Leistung pro Thema anzeigt.",
      "Ein Zertifikat, das per E-Mail zugesendet wird."
    ],
    "loesung": 2,
    "erklaerung": "Am Ende des Tests erhält der Nutzer eine detaillierte Aufschlüsselung seiner Leistung nach den in der JSON-Datei definierten Themen. Dies hilft, gezielt Wissenslücken zu identifizieren und zu schließen.",
    "gewichtung": 2,
    "thema": "Nutzer-Features"
  },
  {
    "frage": "7. Wie unterscheidet sich die Verwaltung von 'markierten Fragen' (Bookmarks) in dieser App von einem typischen Lernset in Quizlet?",
    "optionen": [
      "Markierte Fragen werden automatisch in ein separates PDF exportiert.",
      "Die Markierung dient als temporärer Filter während des Tests und in der Endauswertung.",
      "Markierte Fragen müssen innerhalb von 24 Stunden beantwortet werden.",
      "Quizlet hat keine Funktion, um einzelne Elemente zu markieren."
    ],
    "loesung": 1,
    "erklaerung": "Die Bookmark-Funktion in dieser App ist als Werkzeug für den Test konzipiert. Sie erlaubt es, während des Durchlaufs zu schwierigen Fragen zurückzuspringen und sie im Review-Modus gezielt zu filtern. Es ist kein permanentes Lernset wie in Quizlet.",
    "gewichtung": 2,
    "thema": "Nutzer-Features"
  },
  {
    "frage": "8. Welche Möglichkeit zur Konfiguration des Scoring-Modus bietet das Admin-Panel?",
    "optionen": [
      "Man kann die Punktzahl für jede einzelne Frage individuell anpassen.",
      "Man kann zwischen 'Nur Pluspunkte' und 'Plus-Minus-Punkte' für falsche Antworten umschalten.",
      "Man kann einen Bonus für besonders schnelle Antworten aktivieren.",
      "Man kann den Scoring-Modus nicht ändern, er ist fest auf 1 Punkt pro Frage eingestellt."
    ],
    "loesung": 1,
    "erklaerung": "Der Admin kann global festlegen, ob falsche Antworten neutral mit 0 Punkten oder bestrafend mit negativen Punkten (basierend auf der Gewichtung) bewertet werden. Dies ermöglicht die Anpassung an verschiedene Test-Szenarien.",
    "gewichtung": 2,
    "thema": "Admin-Features"
  },
  {
    "frage": "9. Was ist ein wesentlicher Vorteil der Open-Source-Natur dieser App im Vergleich zu kommerziellen, geschlossenen Plattformen?",
    "optionen": [
      "Garantierter 24/7-Kundensupport per Telefon.",
      "Die App kann beliebig angepasst, erweitert und selbst gehostet werden.",
      "Automatische Updates werden jede Stunde eingespielt.",
      "Die Nutzung ist mit hohen Lizenzgebühren verbunden."
    ],
    "loesung": 1,
    "erklaerung": "Da der gesamte Quellcode offenliegt, kann jeder Entwickler die App an seine spezifischen Bedürfnisse anpassen, neue Features hinzufügen oder sie auf eigener Infrastruktur betreiben, was volle Datenkontrolle und Flexibilität ermöglicht.",
    "gewichtung": 1,
    "thema": "Anpassbarkeit"
  },
  {
    "frage": "10. Welches Feature zur Qualitätssicherung von Fragen bietet diese App, das in einfachen Quiz-Tools oft fehlt?",
    "optionen": [
      "Eine automatische Rechtschreibprüfung für alle Fragen und Antworten.",
      "Die Möglichkeit, Fragen von Nutzern bewerten zu lassen.",
      "Die Berechnung der Trennschärfe (`r_it`), um zu sehen, wie gut eine Frage zwischen starken und schwachen Teilnehmern unterscheidet.",
      "Ein KI-gestützter Generator, der automatisch neue Fragen erstellt."
    ],
    "loesung": 2,
    "erklaerung": "Die Trennschärfe ist eine wichtige psychometrische Kennzahl. Eine gute Frage sollte von Teilnehmern mit hoher Gesamtpunktzahl eher richtig beantwortet werden als von Teilnehmern mit niedriger Punktzahl. Diese Analyse hilft, unfaire oder missverständliche Fragen zu identifizieren.",
    "gewichtung": 3,
    "thema": "Admin-Features"
  },
  {
    "frage": "11. Was ist der Hauptunterschied im Lernansatz zwischen dieser App und Anki?",
    "optionen": [
      "Anki ist für die Simulation von einmaligen Prüfungen mit Zeitlimit optimiert.",
      "Diese App nutzt einen komplexen Algorithmus für 'Spaced Repetition', um Fakten langfristig zu lernen.",
      "Anki fokussiert auf das langfristige Behalten von Fakten durch Wiederholungen, während diese App eine Prüfungssituation simuliert.",
      "Beide Apps verwenden exakt denselben Lernalgorithmus."
    ],
    "loesung": 2,
    "erklaerung": "Ankis Stärke liegt im 'Spaced Repetition System' (SRS) für das Langzeitgedächtnis. Diese App hingegen ist darauf ausgelegt, eine einmalige Prüfungssituation mit MC-Fragen, Zeitdruck und einer finalen Auswertung nachzustellen.",
    "gewichtung": 2,
    "thema": "Lernphilosophie"
  },
  {
    "frage": "12. Welches Feature für **Ersteller von Fragensets** bietet diese App, das in Anki standardmäßig fehlt?",
    "optionen": [
      "Die Möglichkeit, Bilder und Töne in Fragen einzubetten.",
      "Eine detaillierte psychometrische Analyse zur Qualität der Fragen (z.B. Trennschärfe).",
      "Die Synchronisation von Lernkarten über mehrere Geräte hinweg.",
      "Ein Marktplatz zum Teilen und Herunterladen von Decks."
    ],
    "loesung": 1,
    "erklaerung": "Das Admin-Panel dieser App bietet eine Item-Analyse, mit der die Qualität und Fairness der Fragen bewertet werden kann. Dies ist ein Werkzeug für Autoren und Dozenten, das Anki als reines Lernwerkzeug nicht bietet.",
    "gewichtung": 3,
    "thema": "Admin-Features"
  },
  {
    "frage": "13. Wie unterscheidet sich der soziale Aspekt dieser App von der Standardnutzung von Anki?",
    "optionen": [
      "Anki ist primär auf den Wettbewerb in Gruppen ausgelegt, mit integrierten Leaderboards.",
      "Diese App verfügt über ein öffentliches Leaderboard und eine zentrale Datensammlung, was sie für Gruppen- und Kurs-Szenarien geeignet macht.",
      "Beide Apps sind ausschließlich für das isolierte, individuelle Lernen konzipiert.",
      "Diese App erfordert, dass man Freunde einlädt, um Fragensets freizuschalten."
    ],
    "loesung": 1,
    "erklaerung": "Während Anki ein Werkzeug für das persönliche, langfristige Lernen ist, fördert diese App durch das Leaderboard und die zentrale Datenerfassung einen Wettbewerbs- und Vergleichsaspekt innerhalb einer Gruppe oder eines Kurses.",
    "gewichtung": 2,
    "thema": "Grundkonzept & Login"
  },
  {
    "frage": "14. Welcher Aspekt der App-Nutzung ist hier deutlich einfacher als bei Anki?",
    "optionen": [
      "Die Erstellung komplexer, zweiseitiger Lernkarten mit LaTeX.",
      "Die Installation von hunderten von Community-Add-ons.",
      "Der sofortige Start eines Tests ohne vorherige Erstellung oder Import von Lernmaterialien.",
      "Die detaillierte Konfiguration des Spaced-Repetition-Algorithmus."
    ],
    "loesung": 2,
    "erklaerung": "Diese App folgt einem 'Pick-up-and-play'-Prinzip: Der Nutzer wählt ein vorhandenes Fragenset und startet sofort den Test. Bei Anki liegt der Fokus auf dem Erstellen eigener oder dem Importieren fremder Kartendecks, was einen initialen Aufwand erfordert.",
    "gewichtung": 1,
    "thema": "Nutzer-Features"
  },
  {
    "frage": "15. Wie unterscheidet sich die Datenanalyse-Möglichkeit für einen Kursleiter in dieser App von Anki?",
    "optionen": [
      "Anki bietet detaillierte, aggregierte Statistiken über die Leistung einer ganzen Klasse.",
      "Diese App ermöglicht einem Admin den Export aller Antworten als CSV und eine Distraktor-Analyse, was in Anki nicht vorgesehen ist.",
      "Beide Apps bieten identische, cloud-basierte Analyse-Dashboards für Kursleiter.",
      "In dieser App können nur die eigenen, persönlichen Statistiken eingesehen werden."
    ],
    "loesung": 1,
    "erklaerung": "Das Admin-Panel dieser App ist speziell für die Analyse von Testergebnissen einer Gruppe konzipiert. Features wie der CSV-Export aller Antworten und die Distraktor-Analyse (welche falschen Antworten wurden oft gewählt?) sind Werkzeuge für Dozenten, die über die persönlichen Lernstatistiken von Anki weit hinausgehen.",
    "gewichtung": 3,
    "thema": "Admin-Features"
  }
]
