{
  "meta": {
    "title": "Typografische Anführungszeichen, Apostrophe und Auslassungszeichen im Deutschen",
    "created": "21.11.2025",
    "modified": "21.11.2025",
    "target_audience": "Fortgeschrittene mit Grundwissen",
    "question_count": 10,
    "difficulty_profile": {
      "leicht": 1,
      "mittel": 4,
      "schwer": 5
    },
    "time_per_weight_minutes": {
      "1": 0.5,
      "2": 0.75,
      "3": 1.0
    },
    "additional_buffer_minutes": 5,
    "test_duration_minutes": 15
  },
  "questions": [
    {
      "frage": "1. Wie werden die deutschen Standard-Anführungszeichen für ein einfaches Zitat im Fließtext typografisch korrekt gesetzt?",
      "optionen": [
        "\"Zitat\" mit geraden doppelten Anführungszeichen auf gleicher Höhe",
        "„Zitat“ mit unten öffnendem und oben schließendem Anführungszeichen",
        "»Zitat« mit beidseitig nach innen zeigenden Spitzenanführungszeichen",
        "‚Zitat‘ mit einfachen Anführungszeichen sowohl am Anfang als auch am Ende",
        "„Zitat\" mit unten öffnendem und geradem schließendem Anführungszeichen"
      ],
      "loesung": 1,
      "erklaerung": "Im Standarddeutschen werden typografische Anführungszeichen als unten öffnendes „ und oben schließendes “ gesetzt. Gerade Anführungszeichen sind nur technische Ersatzzeichen und französische Guillemets werden im Deutschen nicht als Standard angesehen. Einfache Anführungszeichen werden in der Regel nur für Zitate im Zitat verwendet.",
      "gewichtung": 1,
      "thema": "Grundlagen deutsche Anführungszeichen",
      "konzept": "Form der deutschen Standard-Anführungszeichen",
      "kognitive_stufe": "Reproduktion",
      "mini_glossary": {
        "Anführungszeichen": "Interpunktionszeichen, die wörtliche Rede, Zitate oder besondere Hervorhebungen markieren. Im Deutschen gibt es typografische und gerade Anführungszeichen.",
        "typografische Anführungszeichen": "Satzzeichen, die je nach Sprache unterschiedliche Formen haben. Im Deutschen ist die Standardform „…“ mit unten öffnendem und oben schließendem Zeichen.",
        "gerade Anführungszeichen": "Mit der Tastatur leicht einzugebenes Ersatzzeichen (\"), das in einfachen Textumgebungen verwendet wird, typografisch aber als Notlösung gilt."
      }
    },
    {
      "frage": "2. In welchem Beispiel sind Hauptzitat und Zitat im Zitat mit deutschen Anführungszeichen typografisch korrekt gesetzt?",
      "optionen": [
        "\"Er nannte es 'reine Formsache'\", sagte sie.",
        "„Er nannte es \"reine Formsache\"“, sagte sie.",
        "„Er nannte es ‚reine Formsache“, sagte sie.",
        "„Er nannte es ‚reine Formsache‘“, sagte sie.",
        "„Er nannte es »reine Formsache«“, sagte sie."
      ],
      "loesung": 3,
      "erklaerung": "Im Deutschen werden für das äußere Zitat doppelte Anführungszeichen „…“ und für das innere Zitat einfache Anführungszeichen ‚…‘ verwendet. Das korrekte Beispiel kombiniert daher „Er nannte es ‚reine Formsache‘“, wobei beide Paare vollständig und richtig verschachtelt sind.",
      "gewichtung": 2,
      "thema": "Grundlagen deutsche Anführungszeichen",
      "konzept": "Verschachtelung von Haupt- und Binnenzitat",
      "kognitive_stufe": "Anwendung",
      "extended_explanation": {
        "titel": "Verschachtelte deutsche Anführungszeichen richtig setzen",
        "schritte": [
          "Zuerst wird das äußere Zitat mit den deutschen Standard-Anführungszeichen „…“ markiert, die den gesamten gesprochenen Satz umfassen.",
          "Innerhalb dieses Bereichs wird das Zitat im Zitat mit einfachen Anführungszeichen ‚…‘ gekennzeichnet, die sich klar vom äußeren Paar unterscheiden.",
          "Die Reihenfolge der Zeichen beim Schließen ist umgekehrt zur Öffnung: Zuerst wird das innere Zitat mit ‚ abgeschlossen, dann erst das äußere Zitat mit “.",
          "Gerade Anführungszeichen oder gemischte Formen wie „…\" oder \"…“ sind formal zulässig nur als technische Notlösung, typografisch jedoch nicht korrekt.",
          "Französische Guillemets werden in manchen Publikationen verwendet, sind aber im Standarddeutsch für verschachtelte Zitate unüblich und sollten konsistent ersetzt werden."
        ]
      },
      "mini_glossary": {
        "Binnenzitat": "Ein Zitat, das innerhalb eines bereits zitierten Satzes steht. Es wird im Deutschen mit einfachen Anführungszeichen markiert.",
        "verschachtelte Anführungszeichen": "Kombination von äußeren und inneren Anführungszeichen, bei der sich die Form zwischen den Ebenen unterscheidet.",
        "Guillemets": "Französische Anführungszeichen in der Form »…« oder «…», die in manchen Sprachen und typografischen Traditionen verwendet werden."
      }
    },
    {
      "frage": "3. In welcher Schreibweise wird der Apostroph im Deutschen bei Eigennamen und Pluralbildungen korrekt verwendet?",
      "optionen": [
        "Marias Buch, die CDs, Rock ’n’ Roll",
        "Maria's Buch, die CD's, Rock 'n Roll",
        "Maria's Buch, die CDs, Rock'n'Roll",
        "Marias Buch, die CD's, Rock ’n Roll",
        "Marias Buch, die CDs, Rock n' Roll"
      ],
      "loesung": 0,
      "erklaerung": "Der Genitiv von Namen wie Maria wird ohne Apostroph gebildet, also Marias Buch. Pluralformen von Abkürzungen wie CD werden ebenfalls ohne Apostroph geschrieben, also CDs. Beim festen Ausdruck Rock ’n’ Roll markiert der Apostroph eine Auslassung innerhalb des Wortes und ist dort korrekt.",
      "gewichtung": 2,
      "thema": "Apostrophgebrauch im Deutschen",
      "konzept": "Apostroph bei Genitiv und Plural",
      "kognitive_stufe": "Anwendung",
      "extended_explanation": {
        "titel": "Apostroph bei Genitiv und Plural richtig einsetzen",
        "schritte": [
          "Im Deutschen wird der Genitiv von Personennamen in der Regel ohne Apostroph gebildet, etwa Marias Buch oder Peters Auto.",
          "Pluralformen von Abkürzungen und Zahlen benötigen grundsätzlich keinen Apostroph, sodass man CDs, LKWs oder die 1990er schreibt.",
          "Der Apostroph ist vor allem dann sinnvoll, wenn eine Auslassung markiert werden soll, etwa bei festeingebürgerten Wendungen wie Rock ’n’ Roll.",
          "Schreibungen wie Maria's oder CD's orientieren sich an englischen Mustern und gelten im Standarddeutsch als orthografisch falsch.",
          "In Grenzfällen dient der Apostroph gelegentlich zur Lesbarkeit, etwa bei s-Zusammenstößen, sollte aber nicht zur bloßen Zierde verwendet werden."
        ]
      },
      "mini_glossary": {
        "Genitiv": "Kasus, der meist ein Besitz- oder Zugehörigkeitsverhältnis ausdrückt, zum Beispiel Marias Buch.",
        "Plural": "Mehrzahlform eines Nomens, die im Deutschen je nach Wort unterschiedlich gebildet wird, etwa Bücher, Autos oder CDs.",
        "Apostroph": "Interpunktionszeichen (’ oder '), das im Deutschen vor allem Auslassungen markiert und nicht standardmäßig den Genitiv kennzeichnet."
      }
    },
    {
      "frage": "4. Welche Schreibweise folgt der gängigen Regel für den Genitiv von Eigennamen, die auf s-Laut enden?",
      "optionen": [
        "Hans’s Auto steht vor der Tür.",
        "Hanses Auto steht vor der Tür.",
        "Hanss Auto steht vor der Tür.",
        "Hans sein Auto steht vor der Tür.",
        "Hans’ Auto steht vor der Tür."
      ],
      "loesung": 4,
      "erklaerung": "Bei Eigennamen, die auf einen s-Laut enden, wird im Deutschen der Genitiv häufig mit einem Apostroph statt einer zusätzlichen Genitivendung gebildet. Daher ist Hans’ Auto korrekt. Formen wie Hans’s oder Hanss Auto entsprechen nicht der üblichen Rechtschreibung und wirken künstlich.",
      "gewichtung": 2,
      "thema": "Apostrophgebrauch im Deutschen",
      "konzept": "Genitivbildung bei s-Laut am Wortende",
      "kognitive_stufe": "Anwendung",
      "extended_explanation": {
        "titel": "Genitivbildung bei Eigennamen mit s-Laut",
        "schritte": [
          "Endet ein Eigenname auf einen s-Laut, etwa Hans, Thomas oder Felix, wird die Genitivendung oft nicht als zusätzliche Silbe gesprochen.",
          "Die Rechtschreibung trägt dem Rechnung, indem statt einer geschriebenen Endung -s ein Apostroph gesetzt wird, etwa Hans’ Auto oder Felix’ Jacke.",
          "Schreibungen wie Hans’s orientieren sich an englischen Mustern und wirken im Deutschen fremd, da die zusätzliche Endung nicht gesprochen wird.",
          "Die Form Hans sein Auto ist umgangssprachlich und stilistisch deutlich unterhalb der Standardsprache einzuordnen.",
          "Wichtig ist die konsequente Anwendung der Regel: Entweder konsequent mit Apostroph bei s-Laut-Endung oder in Textsorten mit explizitem Stilwunsch entsprechend begründet abweichend."
        ]
      },
      "mini_glossary": {
        "s-Laut": "Sammelbegriff für Laute, die im Deutschen typischerweise mit s, ss, ß, z oder x wiedergegeben werden und am Wortende wie ein s klingen.",
        "Genitiv-Apostroph": "Verwendung des Apostrophs anstelle einer Genitivendung, insbesondere bei Eigennamen, die auf einen s-Laut enden.",
        "Eigennamen": "Namen von Personen, Orten oder Marken, die meist großgeschrieben werden und im Deutschen eigenen Beugungsregeln folgen."
      }
    },
    {
      "frage": "5. Welche Variante setzt Auslassungszeichen innerhalb eines deutschen Satzes bei Auslassung ganzer Wörter typografisch am korrektesten?",
      "optionen": [
        "Er kam...und ging sofort wieder.",
        "Er kam... und ging sofort wieder.",
        "Er kam ... und ging sofort wieder.",
        "Er kam ...und ging sofort wieder.",
        "Er kam ...und ging sofort wieder..."
      ],
      "loesung": 2,
      "erklaerung": "Werden im Deutschen ganze Wörter ausgelassen, wird die Ellipse als eigene Einheit mit Leerzeichen davor und danach gesetzt. Die Form Er kam ... und ging sofort wieder berücksichtigt diese Regel. Varianten ohne Leerzeichen oder mit zusätzlichen Punkten am Satzende sind inkonsistent.",
      "gewichtung": 2,
      "thema": "Auslassungszeichen und Ellipse",
      "konzept": "Ellipse bei Auslassung ganzer Wörter im Satz",
      "kognitive_stufe": "Anwendung",
      "extended_explanation": {
        "titel": "Abstände bei Auslassungszeichen im Satzinneren",
        "schritte": [
          "Die Ellipse markiert im Deutschen eine Auslassung und besteht typografisch aus drei Punkten, idealerweise als eigenständiges Zeichen.",
          "Werden ganze Wörter ausgelassen, wird die Ellipse wie ein eigenes Wort behandelt und erhält daher ein Leerzeichen davor und danach.",
          "Die Schreibweise Er kam ... und ging sofort wieder folgt diesem Muster und schafft optisch eine klare Abgrenzung.",
          "Werden die Punkte direkt an Wörter angeschlossen, signalisiert dies eher eine Auslassung innerhalb eines Wortes als die Auslassung ganzer Wörter.",
          "Zusätzliche Punkte am Satzende sollten vermieden werden; entweder steht nur die Ellipse oder es wird bei Bedarf eine klare Kombination mit Satzzeichen definiert."
        ]
      },
      "mini_glossary": {
        "Ellipse": "Zeichenfolge aus drei Punkten, die eine Auslassung von Text markiert, entweder innerhalb eines Wortes oder von ganzen Wörtern.",
        "Auslassungszeichen": "Sammelbegriff für Schreibweisen, die eine bewusste Lücke im Text anzeigen, meist in Form von drei Punkten.",
        "Satzinnenstellung": "Positionierung eines Satzzeichens innerhalb eines laufenden Satzes, im Unterschied zur Stellung am Satzende."
      }
    },
    {
      "frage": "6. Welche Beschreibung trifft den Unterschied zwischen Auslassungszeichen innerhalb eines Wortes und bei Auslassung ganzer Wörter im Deutschen am besten?",
      "optionen": [
        "In beiden Fällen werden die Punkte direkt an die umgebenden Wörter angeschlossen.",
        "Innerhalb eines Wortes stehen keine Leerzeichen, bei ganzen Wörtern wird die Ellipse von Leerzeichen umgeben.",
        "Bei ganzen Wörtern stehen keine Leerzeichen, innerhalb eines Wortes immer ein Leerzeichen vor der Ellipse.",
        "In beiden Fällen wird die Ellipse mit Leerzeichen davor geschrieben, aber nie danach.",
        "Innerhalb eines Wortes werden vier Punkte verwendet, bei ganzen Wörtern nur drei Punkte."
      ],
      "loesung": 1,
      "erklaerung": "Wird nur ein Teil eines Wortes ausgelassen, werden die drei Punkte direkt an das Wort angeschlossen, etwa s...n. Bei der Auslassung ganzer Wörter wird die Ellipse wie ein eigenes Wort behandelt und von Leerzeichen umgeben. So wird optisch und funktional deutlich, auf welcher Ebene die Auslassung erfolgt.",
      "gewichtung": 3,
      "thema": "Auslassungszeichen und Ellipse",
      "konzept": "Differenzierte Verwendung der Ellipse",
      "kognitive_stufe": "Analyse",
      "extended_explanation": {
        "titel": "Kontextabhängige Setzung der Ellipse",
        "schritte": [
          "Zunächst ist zu klären, ob die Auslassung nur Teile eines Wortes oder ganze Wörter betrifft, da dies für die Zeichensetzung entscheidend ist.",
          "Bei Auslassungen innerhalb eines Wortes werden die drei Punkte direkt an den verbleibenden Wortrest angeschlossen, um die Wortstruktur zu erhalten.",
          "Werden hingegen ganze Wörter ausgelassen, wird die Ellipse wie ein eigenständiges Wort behandelt und erhält Leerzeichen davor und danach.",
          "Diese Unterscheidung hilft Leserinnen und Lesern, die Art der Verkürzung zu erkennen, ohne den Satz neu konstruieren zu müssen.",
          "Eine konsistente Anwendung dieser Regeln erhöht die Lesbarkeit und die typografische Klarheit, insbesondere in wissenschaftlichen und literarischen Texten."
        ]
      },
      "mini_glossary": {
        "Wortinnere Auslassung": "Auslassung von Buchstaben oder Silben innerhalb eines Wortes, die oft durch eine Ellipse gekennzeichnet wird.",
        "Wortauslassung": "Auslassung eines oder mehrerer vollständiger Wörter in einem Satz, die typografisch meist durch eine Ellipse mit Leerzeichen markiert wird.",
        "Lesbarkeit": "Eigenschaft eines Textes, leicht und eindeutig verstanden zu werden, stark beeinflusst durch konsistente Zeichensetzung."
      }
    },
    {
      "frage": "7. Welche Handhabung von geraden und typografischen Anführungszeichen in digitalen Textsystemen ist aus typografischer Sicht am besten vertretbar?",
      "optionen": [
        "Konsequent nur gerade Anführungszeichen verwenden, da sie auf allen Tastaturen verfügbar sind.",
        "Gerade Anführungszeichen nur für innerdeutsche Zitate, typografische nur für fremdsprachige Zitate verwenden.",
        "Typografische Anführungszeichen nur im Drucksatz, im digitalen Text immer gerade Anführungszeichen verwenden.",
        "Gerade Anführungszeichen und typografische Anführungszeichen nach persönlichem Geschmack mischen.",
        "Gerade Anführungszeichen bei der Eingabe zulassen, sie aber vor Veröffentlichung in typografische Anführungszeichen umwandeln."
      ],
      "loesung": 4,
      "erklaerung": "In vielen digitalen Umgebungen werden gerade Anführungszeichen zunächst als technische Eingabe verwendet. Für veröffentlichte Texte empfiehlt es sich jedoch, diese in typografisch korrekte Anführungszeichen umzuwandeln. So werden technische Einschränkungen und typografischer Anspruch sinnvoll miteinander verbunden.",
      "gewichtung": 3,
      "thema": "Typografie in digitalen Textsystemen",
      "konzept": "Umgang mit Ersatzzeichen in digitalen Workflows",
      "kognitive_stufe": "Analyse",
      "extended_explanation": {
        "titel": "Eingabe- und Ausgabestufe bei Anführungszeichen trennen",
        "schritte": [
          "Digitale Tastaturen bieten meist nur gerade Anführungszeichen an, die als praktische Eingabelösung dienen.",
          "Typografische Qualität wird nicht auf der Eingabestufe, sondern bei der Ausgabe und Veröffentlichung eines Textes bewertet.",
          "Ein sinnvoller Workflow erlaubt daher gerade Anführungszeichen bei der Eingabe und wandelt sie später automatisch in typografische Anführungszeichen um.",
          "Textverarbeitungsprogramme, Satzsysteme und Content-Management-Systeme bieten oft Funktionen zur automatischen Umwandlung oder Suche-und-Ersetze-Regeln.",
          "Durch die Trennung von Eingabe- und Ausgabestufe lassen sich technische Einschränkungen überwinden, ohne auf typografische Qualität zu verzichten."
        ]
      },
      "mini_glossary": {
        "gerade Anführungszeichen": "Einfache Eingabezeichen (\") oder ('), die in vielen Systemen als technische Platzhalter für Anführungszeichen dienen.",
        "typografische Anführungszeichen": "Sprachspezifische Anführungszeichen wie „…“ im Deutschen, die im Schriftsatz als gestalterisch korrekt gelten.",
        "Workflow": "Abfolge von Arbeitsschritten, in diesem Kontext von der Texterstellung über die Bearbeitung bis zur Veröffentlichung."
      }
    },
    {
      "frage": "8. Wie sollten Anführungszeichen in einem deutschen Fachtext mit häufig vorkommenden englischen Begriffen typografisch vorzugsweise gehandhabt werden?",
      "optionen": [
        "Englische Begriffe immer mit englischen Anführungszeichen „like this“ versehen.",
        "Englische Begriffe immer mit geraden Anführungszeichen \"like this\" versehen.",
        "Alle Zitate und Hervorhebungen, auch fremdsprachige, mit den im Deutschen üblichen Anführungszeichen „…“ setzen.",
        "Englische Begriffe gar nicht in Anführungszeichen setzen, um Konflikte zu vermeiden.",
        "Für deutsche Begriffe deutsche Anführungszeichen, für englische Begriffe englische Anführungszeichen verwenden."
      ],
      "loesung": 2,
      "erklaerung": "In einem konsistent gestalteten deutschen Fachtext werden in der Regel die für das Deutsche üblichen Anführungszeichen verwendet, auch wenn englische Begriffe auftreten. Die typografische Konvention richtet sich hier primär nach der Textsprache und nicht nach der Sprachzugehörigkeit einzelner Wörter.",
      "gewichtung": 3,
      "thema": "Typografie in digitalen Textsystemen",
      "konzept": "Sprachkontext und Anführungszeichenwahl",
      "kognitive_stufe": "Analyse",
      "extended_explanation": {
        "titel": "Konsistente Anführungszeichen bei Sprachmischung",
        "schritte": [
          "Die maßgebliche Orientierung für die Zeichensetzung ist die dominante Textsprache, nicht die Sprache einzelner eingefügter Wörter.",
          "In einem primär deutschen Fachtext werden daher auch englische Begriffe, die markiert werden sollen, mit deutschen Anführungszeichen „…“ gesetzt.",
          "Eine Mischung verschiedener nationaler Anführungszeichen im selben Text wirkt unruhig und erschwert die Wahrnehmung eines einheitlichen typografischen Systems.",
          "Gerade Anführungszeichen sollten in der Endfassung vermieden werden, da sie lediglich technische Platzhalter sind.",
          "Nur in besonderen Kontexten, etwa bei typografischen Beispielen oder stilisierten Markenauftritten, kann von dieser Regel bewusst abgewichen werden."
        ]
      },
      "mini_glossary": {
        "Sprachmischung": "Gleichzeitige Verwendung von Wörtern aus verschiedenen Sprachen in einem Text, etwa deutsche Sätze mit englischen Fachbegriffen.",
        "Fachtext": "Text, der ein spezialisiertes Thema behandelt und in der Regel einer definierten wissenschaftlichen oder beruflichen Konvention folgt.",
        "Konsistenz": "Eigenschaft eines Textes, formale und typografische Entscheidungen einheitlich beizubehalten."
      }
    },
    {
      "frage": "9. In welchem Fall ist die Unterscheidung zwischen Apostroph und Minutenzeichen typografisch besonders wichtig?",
      "optionen": [
        "Beim Schreiben von Zeitangaben wie 5′ und bei Auslassungen wie Rock ’n’ Roll.",
        "Beim Schreiben von Datumsangaben wie 5’5’2025.",
        "Bei der Markierung von betonten Silben innerhalb eines Verses.",
        "Bei der Bildung des Plurals von Substantiven wie Auto's.",
        "Bei der Kennzeichnung von Großbuchstaben im Fließtext."
      ],
      "loesung": 0,
      "erklaerung": "Das Minutenzeichen 5′ und der typografische Apostroph ’ sehen ähnlich aus, haben aber unterschiedliche Funktionen. In Zeitangaben steht das Minutenzeichen, während bei Auslassungen wie Rock ’n’ Roll der Apostroph verwendet wird. Eine Verwechslung führt in technischen und typografisch anspruchsvollen Texten zu fachlichen und formalen Fehlern.",
      "gewichtung": 3,
      "thema": "Fehlerquellen und Stilrichtlinien",
      "konzept": "Unterscheidung von ähnlichen Zeichen",
      "kognitive_stufe": "Analyse",
      "extended_explanation": {
        "titel": "Apostroph und Minutenzeichen auseinanderhalten",
        "schritte": [
          "Der typografische Apostroph markiert im Deutschen meist eine Auslassung oder besondere Fügung, etwa in Rock ’n’ Roll.",
          "Das Minutenzeichen ist ein eigenständiges Zeichen, das vor allem in technischen und naturwissenschaftlichen Kontexten für Winkel- oder Zeitangaben verwendet wird, etwa 5′.",
          "Obwohl sich beide Zeichen optisch ähneln, unterscheiden sie sich in Codierung und typografischer Funktion.",
          "Eine Verwechslung kann dazu führen, dass Zeitangaben als Auslassungen oder Auslassungen als Einheiten verstanden werden.",
          "Sorgfältige Zeichenauswahl, insbesondere in Fachpublikationen, erhöht die Präzision und vermeidet Missverständnisse."
        ]
      },
      "mini_glossary": {
        "Apostroph": "Zeichen, das im Deutschen vor allem Auslassungen oder besondere Fügungen markiert, typografisch meist als geschwungenes Zeichen gesetzt.",
        "Minutenzeichen": "Zeichen, das in Winkel- oder Zeitangaben verwendet wird, etwa in 30′ für 30 Minuten oder Bogenminuten.",
        "Zeichenverwechslung": "Fehler, bei dem formal ähnliche Zeichen mit unterschiedlichen Bedeutungen unabsichtlich vertauscht werden."
      }
    },
    {
      "frage": "10. Welche Richtlinie für die Verwendung von Anführungszeichen und Apostrophen trägt in einem längeren deutschen Fließtext am stärksten zur typografischen Einheitlichkeit bei?",
      "optionen": [
        "Innerhalb eines Kapitels alle Anführungszeichen einheitlich setzen, zwischen Kapiteln aber frei variieren.",
        "Anführungszeichen und Apostrophe je nach aktueller Textstelle intuitiv wählen.",
        "Zitate immer mit geraden Anführungszeichen, Hervorhebungen mit typografischen Anführungszeichen markieren.",
        "Für den gesamten Text ein konsistentes System typografischer Anführungszeichen und Apostrophe festlegen und einhalten.",
        "Für Namen typografische Zeichen, für alle anderen Wörter gerade Zeichen verwenden."
      ],
      "loesung": 3,
      "erklaerung": "Typografische Einheitlichkeit entsteht, wenn für den gesamten Text ein konsistentes System festgelegt und konsequent umgesetzt wird. Das betrifft sowohl die Form der Anführungszeichen als auch die Verwendung des Apostrophs. Punktuelle oder kapitelweise Variation wirkt unruhig und erschwert das Lesen.",
      "gewichtung": 3,
      "thema": "Fehlerquellen und Stilrichtlinien",
      "konzept": "Konsistenzregeln für Satzzeichen",
      "kognitive_stufe": "Analyse",
      "extended_explanation": {
        "titel": "Konsistentes Zeichensystem im Fließtext etablieren",
        "schritte": [
          "Zu Beginn eines Projekts sollte festgelegt werden, welche Formen von Anführungszeichen und Apostrophen im gesamten Text verwendet werden.",
          "Diese Entscheidung orientiert sich an Sprache, Medium und gegebenenfalls an einem bestehenden Styleguide.",
          "Im weiteren Verlauf ist wichtig, dass alle Beteiligten dieses System kennen und konsequent anwenden, um Brüche zu vermeiden.",
          "Automatisierte Prüfungen, etwa durch Suchen-und-Ersetzen-Regeln oder Stilprüfungen, können helfen, Ausreißer zu finden.",
          "Ein konsistentes Zeichensystem unterstützt die professionelle Wahrnehmung eines Textes und erleichtert die Pflege in späteren Auflagen oder Versionen."
        ]
      },
      "mini_glossary": {
        "Fließtext": "Zusammenhängender Text ohne starke Gliederung durch Tabellen oder Listen, der fortlaufend gelesen wird.",
        "Styleguide": "Dokument mit verbindlichen Regeln zu Sprache, Typografie und Gestaltung, an dem sich Autorinnen und Autoren orientieren.",
        "Einheitlichkeit": "Eigenschaft eines Textes, formale und gestalterische Entscheidungen konsequent durchzuhalten, um einen geschlossenen Eindruck zu erzeugen."
      }
    }
  ]
}
